In [1]:
#Lets start to learn DataFrame

In [2]:
import pandas as pd

In [20]:
data = {"Name":['Elmir','Orxan','Abidin'],
       "Sport":['Football','Basketball','HandBall'],
       "Age":[16,18,21],
       "Gender":['Man','Man','Man']}

df = pd.DataFrame(data)

In [13]:
#df.tail(n)
#Default n = 5
#Get last n row (just edit n)
df.tail(n=1)

    Names     Sport  Age Gender
2  Abidin  HandBall   21    Man

In [26]:
#Columns swap
df = pd.DataFrame(data,columns=['Gender','Age','Sport','Name','Point']) #->> # Swap add 'Point' without value
#Lets check it
df.isnull()

   Gender    Age  Sport   Name  Point
0   False  False  False  False   True
1   False  False  False  False   True
2   False  False  False  False   True

In [33]:
#Edit index
df = pd.DataFrame(data,columns=['Gender','Age','Sport','Name'],index=['A','B','C'])

  Gender  Age       Sport    Name
A    Man   16    Football   Elmir
B    Man   18  Basketball   Orxan
C    Man   21    HandBall  Abidin

In [37]:
df['Age'] #get single column
df[['Age','Sport']] #get multi column

   Age       Sport
A   16    Football
B   18  Basketball
C   21    HandBall

In [38]:
#Get data with index
df.loc[['A']] #df.loc[['A','B']]

  Gender  Age     Sport   Name
A    Man   16  Football  Elmir

In [43]:
#Create new column with mini filter and delete it

df['The largest']=df.Age > 18
del df['The largest']

  Gender  Age       Sport    Name
A    Man   16    Football   Elmir
B    Man   18  Basketball   Orxan
C    Man   21    HandBall  Abidin

In [56]:
#Some functions:
df.T #-> Replace columns with row (swap)
df.columns.name = 'My columns' #Give name to columns
df.index.name = 'My index' #to index
df.values
m_index = df.index #--> Set index(or other thing) to ummutable
m_index['1']='Con' #--> TypeError: Index does not support mutable operations